app/Models/Customer.php

    public function get_stats(int $customer_id)
    {
        $db_prefix = $this->db->getPrefix();
        $totals_decimals = totals_decimals();
        $quantity_decimals = quantity_decimals();

        $builder = $this->db->table('sales AS s');

        $builder->select([
            'COALESCE(SUM(' . $db_prefix . 'sales_payments.payment_amount - ' . $db_prefix . 'sales_payments.cash_refund), 0) AS total',
            'COALESCE(MIN(' . $db_prefix . 'sales_payments.payment_amount - ' . $db_prefix . 'sales_payments.cash_refund), 0) AS min',
            'COALESCE(MAX(' . $db_prefix . 'sales_payments.payment_amount - ' . $db_prefix . 'sales_payments.cash_refund), 0) AS max',
            'COALESCE(AVG(' . $db_prefix . 'sales_payments.payment_amount - ' . $db_prefix . 'sales_payments.cash_refund), 0) AS average',
            "ROUND( (SELECT AVG(avg_disc) FROM (SELECT AVG(si.discount) as avg_disc FROM " . $db_prefix . "sales_items si JOIN " . $db_prefix . "sales s2 ON si.sale_id = s2.sale_id WHERE s2.customer_id = " . $this->db->escape($customer_id) . " AND s2.sale_status = 0 GROUP BY si.sale_id) as temp), $totals_decimals) AS avg_discount",
            "ROUND(SUM(" . $db_prefix . "sales_items.quantity_purchased), $quantity_decimals) AS quantity"
        ]);

        $builder->join($db_prefix . 'sales_payments', 's.sale_id = ' . $db_prefix . 'sales_payments.sale_id');
        $builder->join($db_prefix . 'sales_items', 's.sale_id = ' . $db_prefix . 'sales_items.sale_id');
        $builder->where('s.customer_id', $customer_id);
        $builder->where('s.sale_status', COMPLETED);
        $builder->groupBy('s.customer_id');

        $stat = $builder->get()->getRow();
---
SELECT COALESCE(SUM(ospos_sales_payments.payment_amount - ospos_sales_payments.cash_refund), 0) AS total, COALESCE(MIN(ospos_sales_payments.payment_amount - ospos_sales_payments.cash_refund), 0) AS min, COALESCE(MAX(ospos_sales_payments.payment_amount - ospos_sales_payments.cash_refund), 0) AS max, COALESCE(AVG(ospos_sales_payments.payment_amount - ospos_sales_payments.cash_refund), 0) AS average, ROUND( (SELECT AVG(avg_disc) FROM (SELECT AVG(si.discount) as avg_disc FROM ospos_sales_items si JOIN ospos_sales s2 ON si.sale_id = s2.sale_id WHERE s2.customer_id = 2 AND s2.sale_status = 0 GROUP BY si.sale_id) as temp), 2) AS avg_discount, ROUND(SUM(ospos_sales_items.quantity_purchased), 0) AS quantity
FROM `ospos_sales` AS `s`
JOIN `ospos_sales_payments` ON `s`.`sale_id` = `ospos_sales_payments`.`sale_id`
JOIN `ospos_sales_items` ON `s`.`sale_id` = `ospos_sales_items`.`sale_id`
WHERE `s`.`customer_id` = 2
AND `s`.`sale_status` = 0
GROUP BY `s`.`customer_id`
SELECT COALESCE(SUM(sales_payments.payment_amount - sales_payments.cash_refund), 0) AS total, COALESCE(MIN(sales_payments.payment_amount - sales_payments.cash_refund), 0) AS min, COALESCE(MAX(sales_payments.payment_amount - sales_payments.cash_refund), 0) AS max, COALESCE(AVG(sales_payments.payment_amount - sales_payments.cash_refund), 0) AS average, ROUND( (SELECT AVG(avg_disc) FROM (SELECT AVG(si.discount) as avg_disc FROM sales_items si JOIN sales s2 ON si.sale_id = s2.sale_id WHERE s2.customer_id = sales.customer_id AND s2.sale_status = COMPLETED GROUP BY si.sale_id) as temp), 2) AS avg_discount, ROUND(SUM(sales_items.quantity_purchased), 0) AS quantity
FROM `ospos_sales`
JOIN `ospos_sales_payments` ON `ospos_sales`.`sale_id` = `ospos_sales_payments`.`sale_id`
JOIN `ospos_sales_items` ON `ospos_sales`.`sale_id` = `ospos_sales_items`.`sale_id`
WHERE `ospos_sales`.`customer_id` = 2
AND `ospos_sales`.`sale_status` = 0
GROUP BY `ospos_sales`.`customer_id`